var _Answers = {
	content1: [
		{
			answer: "96",
			text: "На картинке изображены цифры 9 и 6, которые видны как людям с нормальным зрением, так и людям с дальтонизмом. Картинка призвана объяснить и показать людям, что именно требуется делать при прохождении теста."
		},
		
		{
			answer: "Квадрат и треугольник",
			text: "На данной картинке изображены квадрат и треугольник, которые видны, как и в предыдущем варианте, и людям с нормальным зрением, и людям с дальтонизмом. Картинка используется для демонстрации теста и для выявления симуляции."
		},
		
		{
			answer: "9",
			text: "На картинке изображена цифра 9. Люди с нормальным зрением видят правильно, тогда как люди со слепотой в красной или зелёной части спектра (дейтеранопия и протанопия) видят цифру 5."
		},
		
		{
			answer: "Треугольник",
			text: "На картинке изображён треугольник. Люди с нормальным зрением видят изображённый треугольник, тогда как люди со слепотой в красной или зелёной части спектра видят круг."
		},
		
		{
			answer: "13",
			text: "На картинке изображены цифры 1 и 3 (отвечают 13). Люди со слепотой в красной или зелёной части спектра видят цифру 6."
		},
		
		{
			answer: "Треугольник и круг",
			text: "Люди с нормальным цветовосприятием различают на картинке две геометрические фигуры – треугольник и круг, тогда как люди со слепотой в красной или зелёной части спектра различить изображённые на картинке фигуры не способны."
		},
		
		{
			answer: "9",
			text: "На картинке изображена цифра 9, которую способны различить как люди с нормальным цветовосприятием, так и люди с явлениями дальтонизма."
		},
		
		{
			answer: "5",
			text: "На картинке изображена цифра 5, которую способны различить люди с нормальным зрением и люди со слепотой в красной или зелёной части спектра. Однако для последних подобное даётся с трудом или вообще становится невозможным."
		},
		
		{
			answer: "9",
			text: "Люди с нормальным цветовосприятием и люди со слепотой в зелёной части спектра способны различить на картинке цифру 9, тогда как люди со слепотой в красной части спектра могут увидеть как цифру 9, так и 8 или 6."
		},
		
		{
			answer: "136",
			text: "Люди с нормальным зрением различают на картинке цифры 1, 3 и 6 (отвечают 136), при этом люди со слепотой в красной или зелёной части спектра видят 69, 68 или 66."
		},
		
		{
			answer: "14",
			text: "На картинке изображены цифры 1 и 4, которые видят как люди с обычным цветовосприятием, так и люди с проявлениями дальтонизма."
		},
		
		{
			answer: "12",
			text: "На картинке изображены цифры 1 и 2, которые способны различить как люди с обычным зрением, так и люди со слепотой в зелёной части спектра, тогда как люди со слепотой в красной части спектра цифры не видят вообще."
		},
		
		{
			answer: "Круг и треугольник",
			text: "На картинке изображены круг и треугольник, которые способны различить люди с обычным цветовосприятием. При этом люди со слепотой в красной части спектра на картинке видят только круг, тогда как люди со слепотой в зелёной части спектра только треугольник."
		},
		
		{
			answer: "30",
			text: "Люди с обычным цветовосприятием на картинке различат в верхней части цифры 3 и 0, при этом в нижней части не увидят ничего. Тогда как люди со слепотой в красной части спектра различат в верхней части цифры 1 и 0, а в нижней скрытую цифру 6. А люди со слепотой в зелёной части спектра увидят сверху 1, а внизу картинки – 6."
		},
		
		{
			answer: "Круг и треугольник",
			text: "Люди с обычным цветовосприятием на картинке различат круг и треугольник (в верхней части), а в нижней части ничего не увидят. Люди со слепотой в красной части спектра увидят 2 треугольника (вверху) и квадрат (внизу). Люди со слепотой в зелёной части спектра различат треугольник (вверху) и квадрат (снизу)."
		},
		
		{
			answer: "96",
			text: "Люди с обычным цветовосприятием на картинке различат цифры 9 и 6, тогда как люди со слепотой в красной части спектра только 9, а со слепотой в зелёной части спектра – только 6."
		},
		
		{
			answer: "Круг и треугольник",
			text: "Люди с обычным цветовосприятием видят на картинке круг и треугольник, при этом люди со слепотой в красной части спектра только треугольник, тогда как люди со слепотой в зелёной части спектра – только круг."
		},
		
		{
			answer: "Разноцветные вертикальные и одноцветные горизонтальные ряды",
			text: "Люди с обычным цветовосприятием на картинке увидят разноцветные вертикальные и одноцветные горизонтальные ряды. При этом люди со слепотой в красной части спектра увидят горизонтальные ряды как одноцветные, а вертикальные 3, 5 и 7 как одноцветные. Люди со слепотой в зелёной части спектра увидят горизонтальные ряды как разноцветные, а вертикальные 1, 2, 4, 6 и 8 как одноцветные."
		},
		
		{
			answer: "25",
			text: "Люди с обычным зрением способны различить на картинке цифры 2 и 5, тогда как люди со слепотой в красной или зелёной части спектра увидят только лишь цифру 5."
		},
		
		{
			answer: "Треугольник и круг",
			text: "Люди с обычным цветовосприятием способны различить на картинке две геометрические фигуры – треугольник и круг, тогда как люди со слепотой в красной или зелёной части спектра различить изображённые фигуры не смогут."
		},
		
		{
			answer: "96",
			text: "На картинке люди с обычным цветовосприятием и люди со слепотой в красной части спектра различат цифры 9 и 6, тогда как люди со слепотой в зелёной части спектра увидят только лишь цифру 6."
		},
		
		{
			answer: "5",
			text: "На картинке изображена цифра 5, которую способны различить как люди с обычным цветовосприятием, так и люди с проявлениями дальтонизма. Однако для последних подобное сделать будет затруднительно или вообще невозможно."
		},
		
		{
			answer: "Разноцветные горизонтальные и одноцветные вертикальные ряды",
			text: "На картинке люди с обычным зрением увидят разноцветные горизонтальные и одноцветные вертикальные ряды. При этом люди со слепотой в красной или зелёной части спектра видят одноцветные горизонтальные и разноцветные вертикальные ряды."
		},
		
		{
			answer: "2",
			text: "На картинке цифра 2 именно её видят люди с нормальным зрением, протанопы и дейтеранопы эту цифру не различают."
		},
		
		{
			answer: "2",
			text: "Трихоматы (люди с нормальным зрением) видят на картинке цифру 2, люди со слепотой в зеленой и красной частях сектра, цифру 2 не различают."
		},
		
		{
			answer: "Треугольник и квадрат",
			text: "Люди с нормальным цветовосприятием различают на картинке две фигуры: треугольник и квадрат. Люди со слепотой в зеленом и красном спектрах, эти фигуры не различают."
		},
		
		{
			answer: "Треугольник",
			text: "Нормальные трихоматы видят на картинке треугольник, люди с нарушениями цветовосприятия различают фигуру «круг»"
		}
	],
	
	content2: [
		{
			answer: "96",
			text: "Все нормальные трихроматы, аномальные трихроматы и дихроматы различают в таблице одинаково правильно цифры 9 и 6 (96). Таблица предназначена главным образом для демонстрации метода и для контрольных целей."
		},
		
		{
			answer: "Треугольник и круг",
			text: "Все нормальные трихроматы, аномальные трихроматы и дихроматы различают в таблице одинаково правильно две фигуры: треугольник и круг. Как и первая таблица, она предназначена главным образом для демонстрации метода и для контрольных целей."
		},
		
		{
			answer: "9",
			text: "Нормальные трихроматы различают в таблице цифру 9. Протанопы и дейтеранопы различают цифру 5."
		},
		
		{
			answer: "Треугольник",
			text: "Нормальные трихроматы различают в таблице треугольник. Протанопы и дейтеранопы видят круг."
		},
		
		{
			answer: "13",
			text: "Нормальные трихроматы различают в таблице цифры 1 и 3 (13). Протанопы и дейтеранопы читают эту цифру как 6."
		},
		
		{
			answer: "Треугольник и круг",
			text: "Нормальные трихроматы различают в таблице две фигуры: круг и треугольник. Протанопы и дейтеранопы этих фигур не различают."
		},
		
		{
			answer: "96",
			text: "Нормальные трихроматы и протанопы различают в таблице две цифры — 9 и 6. Дейтеранопы различают только цифру 6."
		},
		
		{
			answer: "5",
			text: "Нормальные трихроматы различают в таблице цифру 5. Протанопы и дейтеранопы эту цифру различают с трудом, или вовсе её не различают."
		},
		
		{
			answer: "9",
			text: "Нормальные трихроматы и дейтеранопы различают в таблице цифру 9. Протанопы читают её, как 6 или 8."
		},
		
		{
			answer: "136",
			text: "Нормальные трихроматы различают в таблице цифры 1, 3 и 6 (136). Протанопы и дейтеранопы читают вместо них две цифры 66, 68 или 69."
		},
		
		{
			answer: "Треугольник и круг",
			text: "Нормальные трихроматы различают в таблице круг и треугольник. Протанопы различают в таблице треугольник, а дейтеранопы — круг, или круг и треугольник."
		},
		
		{
			answer: "12",
			text: "Нормальные трихроматы и дейтеранопы различают в таблице цифры 1 и 2 (12). Протанопы эти цифры не различают."
		},
		
		{
			answer: "Треугольник и круг",
			text: "Нормальные трихроматы читают в таблице круг и треугольник. Протанопы различают только круг, а дейтеранопы — треугольник."
		},
		
		{
			answer: "30",
			text: "Нормальные трихроматы различают в верхней части таблицы цифры 3 и 0 (30), а в нижней — ничего не различают. Протанопы читают в верхней части таблицы цифры 1 и 0 (10), а в нижней — скрытую цифру 6. Дейтеранопы различают в верхней части таблицы цифру 1, а в нижней — скрытую цифру 6."
		},
		
		{
			answer: "Треугольник и круг",
			text: "Нормальные трихроматы различают в верхней части таблицы две фигуры: круг слева и треугольник справа. Протанопы различают в верхней части таблицы два треугольника и в нижней части — квадрат, а дейтеранопы — вверху слева треугольник, а внизу — квадрат."
		},
		
		{
			answer: "96",
			text: "Нормальные трихроматы различают в таблице цифры 9 и 6 (96). Протанопы различают в ней лишь одну цифру 9, дейтеранопы — только цифру 6."
		},
		
		{
			answer: "Треугольник и круг",
			text: "Нормальные трихроматы различают две фигуры: треугольник и круг. Протанопы различают в таблице треугольник, а дейтеранопы — круг."
		},
		
		{
			answer: "Одноцветные горизонтальные ряды и разноцветные вертикальные",
			text: "Нормальные трихроматы воспринимают имеющиеся в таблице горизонтальные ряды по восемь квадратов в каждом (цветовые ряды 9-й, 10-й, 11-й, 12-й, 13-й, 14-й, 15-й и 16-й) как одноцветные; вертикальные же ряды воспринимаются ими как разноцветные. Дихроматы же воспринимают вертикальные ряды как одноцветные, причем протанопы принимают как одноцветные вертикальные цветовые ряды — 3-й, 5-й и 7-й, а дейтеранопы — вертикальные цветовые ряды — 1-й, 2-й, 4-й, 6-й и 8-й. Цветные квадраты, расположенные по горизонтали, воспринимаются протанопами и дейтеранопами как разноцветные."
		},
		
		{
			answer: "95",
			text: "Нормальные трихроматы различают в таблице цифры 9 и 5 (95). Протанопы и дейтеранопы различают лишь цифру 5."
		},
		
		{
			answer: "Круг и треугольник",
			text: "Нормальные трихроматы различают в таблице круг и треугольник. Протанопы и дейтеранопы этих фигур не различают."
		},
		
		{
			answer: "66",
			text: "Нормальные трихроматы различают в таблице две цифры — 66. Протанопы и дейтеранопы правильно различают лишь одну из этих цифр."
		},
		
		{
			answer: "36",
			text: "Нормальные трихроматы, протанопы и дейтеранопы различают в таблице число 36. Лица с выраженной приобретенной патологией цветового зрения этих цифр не различают."
		},
		
		{
			answer: "14",
			text: "Нормальные трихроматы, протанопы и дейтеранопы различают в таблице число 14. Лица с выраженной приобретенной патологией цветового зрения этих цифр не различают."
		},
		
		{
			answer: "9",
			text: "Нормальные трихроматы, протанопы и дейтеранопы различают в таблице цифру 9. Лица с выраженной приобретенной патологией цветового зрения эту цифру не различают."
		},
		
		{
			answer: "4",
			text: "Нормальные трихроматы, протанопы и дейтеранопы различают в таблице цифру 4. Лица с выраженной приобретенной патологией цветового зрения эту цифру не различают."
		},
		
		{
			answer: "13",
			text: "Нормальные трихроматы различают в таблице число 13. Протанопы и дейтеранопы это число не различают."
		}
	],
	
	getAns: function(elem, mode){
		if (mode) return this.content2[elem-1].answer;
		else return this.content1[elem-1].answer;
	},
	
	getTxt: function(elem, mode){
		if (mode) return this.content2[elem-1].text;
		else return this.content1[elem-1].text;
	}
};